InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>Цены номенклатуры</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСоСправочниками/Ext/Module.bsl
&НаСервере
Функция РозничнаяЦена(АктуальнаяДата, Номенклатура) Экспорт  
	Отбор = Новый Структура("Номенклатура",Номенклатура);  
	Результат = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат Результат.Цена;
КонецФункции  

&НаСервере
Функция Себестоимость(АктуальнаяДата, Номенклатура) Экспорт  
	Отбор = Новый Структура("Номенклатура",Номенклатура);  
	Результат = РегистрыСведений.ЦеныПоставщиков.ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат Результат.Цена;
КонецФункции   

&НаСервере
Функция ЗП_Сотрудника(Сотрудник) Экспорт  
	Отбор = Новый Структура("Сотрудник",Сотрудник);  
	Результат = Справочники.Сотрудники.ПолучитьДанныеВыбора(Отбор);
	Сообщить(Результат);
	Возврат Результат.ЗаработнаяПлата;
КонецФункции
